# Вводимо 5-х значне число з клавіатури, з урахуванням того, що це число повинно бути цілим та додатним
number = int(input("Будь ласка, введить 5-ти значне число: "))
# Отримуємо останню 5-ту цифру digit1 з 5-ти значного числа, яка є залишком від ділення на 10
digit1 = number % 10
# Отримуємо 4-ту цифру digit2 з 5-ти значного числа, яка є залишком від ділення на 10 після видалення останньої цифри
digit2 = (number // 10) % 10
# Отримуємо 3-тю цифру digit3 з 5-ти значного числа, яка є залишком від ділення на 100 після видалення останньої цифри
digit3 = (number // 100) % 10
# Отримуємо 2-гу цифру digit4 з 5-ти значного числа, яка є залишком від ділення на 1000 після видалення останньої цифри
digit4 = (number // 1000) % 10
# Отримуємо 1-шу цифру digit5 з 5-ти значного числа, яка є залишком від ділення на 10000
digit5 = number // 10000
# Виставоляємо цифри в зворотньому порядку
number_in_reverse_order = (digit1 * 10000) + (digit2 * 1000) + (digit3 * 100) + (digit4 * 10) + digit5
# Виводимо 5-ти значне число в зворотньому порядку
print("5-ти значне число у зворотньому порядку:", number_in_reverse_order)