# Вводимо 4-х значне число з клавіатури, з урахуванням того, що це число повинно бути цілим
number = int(input("Будь ласка, введить 4-х значне число: "))
# Отримуємо першу цифру digit1 з 4-х значного числа та залишок
digit1, remainder = divmod(number, 1000)
# Отримуємо другу цифру digit2 з 4-х значного числа та залишок
digit2, remainder = divmod(remainder,100)
# Отримуємо третю цифру digit3 та четверту цифру digit4 з 4-х значного числа34567
digit3, digit4 = divmod(remainder,10)
# Виводимо кожну цифру з 4-х значного числа в стовпчик з нового рядку
print(digit1)
print(digit2)
print(digit3)
print(digit4)